# GetWInsLocOffByStyle

## Description
Gets whether the wall insert location offset of a symbol definition, plug-in object style, or plug-in object is by style.

```pascal
FUNCTION GetWInsLocOffByStyle(hObject : HANDLE) : BOOLEAN;
```

```python

def vs.GetWInsLocOffByStyle(hObject):
    return BOOLEAN
```

## Parameters
|Name|Type|Description|
|---|---|---|
|hObject|HANDLE|The symbol definition, plug-in object style, or plug-in object.|

## Returns
Whether the wall insert location offset of the symbol definition, plug-in object style, or plug-in object is by style.

## See Also
VS Functions:
SetWInsLocOffByStyle

## Version
Availability: from Vectorworks 2022
## Category
* Objects - Custom